# ClearCoverExterior Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ClearCoverExterior Property
ParameterTypeId Class See Also
---
"Rebar Cover - Exterior Face"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ClearCoverExterior { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClearCoverExterior As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ClearCoverExterior {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace